{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"input4","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input4"},"inbound_nodes":[]},{"name":"Alohomora","class_name":"Dense","config":{"units":784,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"Alohomora","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"WingardiumLeviosa","class_name":"Dense","config":{"units":784,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"WingardiumLeviosa","trainable":true},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"Flipendo","class_name":"Dense","config":{"units":784,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"Flipendo","trainable":true},"inbound_nodes":[[["input3",0,0,{}]]]},{"name":"Accio","class_name":"Dense","config":{"units":784,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"Accio","trainable":true},"inbound_nodes":[[["input4",0,0,{}]]]},{"name":"myConcatenate1","class_name":"Concatenate","config":{"axis":1,"name":"myConcatenate1","trainable":true},"inbound_nodes":[[["Alohomora",0,0,{}],["WingardiumLeviosa",0,0,{}],["Flipendo",0,0,{}],["Accio",0,0,{}]]]},{"name":"myConcatenate1Dense4","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"myConcatenate1Dense4","trainable":true},"inbound_nodes":[[["myConcatenate1",0,0,{}]]]}],"input_layers":[["input1",0,0],["input2",0,0],["input3",0,0],["input4",0,0]],"output_layers":[["myConcatenate1Dense4",0,0]]},"keras_version":"tfjs-layers 0.10.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./myknnclassifierModel01.weights.bin"],"weights":[{"name":"Alohomora/kernel","shape":[1,784],"dtype":"float32"},{"name":"Alohomora/bias","shape":[784],"dtype":"float32"},{"name":"WingardiumLeviosa/kernel","shape":[1,784],"dtype":"float32"},{"name":"WingardiumLeviosa/bias","shape":[784],"dtype":"float32"},{"name":"Flipendo/kernel","shape":[1,784],"dtype":"float32"},{"name":"Flipendo/bias","shape":[784],"dtype":"float32"},{"name":"Accio/kernel","shape":[1,784],"dtype":"float32"},{"name":"Accio/bias","shape":[784],"dtype":"float32"},{"name":"myConcatenate1Dense4/kernel","shape":[3136,1],"dtype":"float32"},{"name":"myConcatenate1Dense4/bias","shape":[1],"dtype":"float32"}]}]}